** Devstack test

Plan for sriov test:
1. Add fake pci devices to compute node.
   After nova-compute restart the pci_device table should be updated
   having fake pci devices there.
2. Add tags via pci passthrough_whitelist.
   1. {vendor_id: ..., switch: sw1, networkgroup: nw1}
   2. {vendor_id: ..., switch: sw2, networkgroup: nw1}
   3. {vendor_id: ..., switch: sw2, networkgroup: nw2}
3. Add pci alias.
   All fake pci devices have the same vendor_id, product_id so we can
   use pci.alias for selecting devices.
   pci.alias = {name: ..., vendor_id: ..., product_id: ...}
4. Create flavor with pci_passthrough alias property.
5. Boot server with flavor.
6. Test results are:
   nova-scheduler logs have messages about pci request updates.
   nova-compute failed to load pci devices, probably, somewhere in logs
   there is information about updated pci requests.

1. Can be done without VM reboot.
   virt-manager: double click on VM, (i) show virtual hardware details, add hardware, network
   results can be viewed with
   #+BEGIN_SRC sh :session shell_james
   lspci -nn | grep -i ethernet
   #+END_SRC

   #+RESULTS:
   : 00:03.0 Ethernet controller [0200]: Red Hat, Inc Virtio network device [1af4:1000]
   : 00:0a.0 Ethernet controller [0200]: Realtek Semiconductor Co., Ltd. RTL-8100/8101L/8139 PCI Fast Ethernet Adapter [10ec:8139] (rev 20)
   : 00:0b.0 Ethernet controller [0200]: Realtek Semiconductor Co., Ltd. RTL-8100/8101L/8139 PCI Fast Ethernet Adapter [10ec:8139] (rev 20)
   : 00:0c.0 Ethernet controller [0200]: Realtek Semiconductor Co., Ltd. RTL-8100/8101L/8139 PCI Fast Ethernet Adapter [10ec:8139] (rev 20)

2. Nova config.
   #+BEGIN_SRC text
   [DEFAULT]
   scheduler_default_filters = RetryFilter,AvailabilityZoneFilter,RamFilter,DiskFilter,ComputeFilter,ComputeCapabilitiesFilter,ImagePropertiesFilter,ServerGroupAntiAffinityFilter,ServerGroupAffinityFilter,SameHostFilter,DifferentHostFilter,PciPassthroughFilter

   [pci]
   passthrough_whitelist = {"address": "00:0a.0", "switch": "sw1", "networkgroup":"nw1"}
   passthrough_whitelist = {"address": "00:0b.0", "switch": "sw2", "networkgroup":"nw1"}
   passthrough_whitelist = {"address": "00:0c.0", "switch": "sw2", "networkgroup":"nw2"}
   alias = {"name": "network", "vendor_id": "10ec", "product_id": "8139", "device_type": "type-PCI"}
   #+END_SRC
   nova-api, nova-compute, nova-scheduler have to be restarted

   #+BEGIN_SRC text
   select * from pci_devices;
   +---------------------+------------+------------+---------+----+-----------------+--------------+------------+-----------+----------+------------------+-----------------+-----------+------------+---------------+------------+-----------+-------------+
   | created_at          | updated_at | deleted_at | deleted | id | compute_node_id | address      | product_id | vendor_id | dev_type | dev_id           | label           | status    | extra_info | instance_uuid | request_id | numa_node | parent_addr |
   +---------------------+------------+------------+---------+----+-----------------+--------------+------------+-----------+----------+------------------+-----------------+-----------+------------+---------------+------------+-----------+-------------+
   | 2017-05-22 10:24:13 | NULL       | NULL       |       0 |  1 |               1 | 0000:00:0a.0 | 8139       | 10ec      | type-PCI | pci_0000_00_0a_0 | label_10ec_8139 | available | {}         | NULL          | NULL       |      NULL | NULL        |
   | 2017-05-22 10:24:13 | NULL       | NULL       |       0 |  2 |               1 | 0000:00:0b.0 | 8139       | 10ec      | type-PCI | pci_0000_00_0b_0 | label_10ec_8139 | available | {}         | NULL          | NULL       |      NULL | NULL        |
   | 2017-05-22 10:24:13 | NULL       | NULL       |       0 |  3 |               1 | 0000:00:0c.0 | 8139       | 10ec      | type-PCI | pci_0000_00_0c_0 | label_10ec_8139 | available | {}         | NULL          | NULL       |      NULL | NULL        |
   +---------------------+------------+------------+---------+----+-----------------+--------------+------------+-----------+----------+------------------+-----------------+-----------+------------+---------------+------------+-----------+-------------+
   3 rows in set (0,00 sec)

   select pci_stats from compute_nodes;
   +---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
   | pci_stats                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        |
   +---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
   |
   {
       "nova_object.changes": [
           "objects"
       ],
       "nova_object.data": {
           "objects": [
               {
                   "nova_object.changes": [
                       "count",
                       "numa_node",
                       "vendor_id",
                       "product_id",
                       "tags"
                   ],
                   "nova_object.data": {
                       "count": 1,
                       "numa_node": null,
                       "product_id": "8139",
                       "tags": {
                           "dev_type": "type-PCI",
                           "networkgroup": "nw1",
                           "switch": "sw1"
                       },
                       "vendor_id": "10ec"
                   },
                   "nova_object.name": "PciDevicePool",
                   "nova_object.namespace": "nova",
                   "nova_object.version": "1.1"
               },
               {
                   "nova_object.changes": [
                       "count",
                       "numa_node",
                       "vendor_id",
                       "product_id",
                       "tags"
                   ],
                   "nova_object.data": {
                       "count": 1,
                       "numa_node": null,
                       "product_id": "8139",
                       "tags": {
                           "dev_type": "type-PCI",
                           "networkgroup": "nw1",
                           "switch": "sw2"
                       },
                       "vendor_id": "10ec"
                   },
                   "nova_object.name": "PciDevicePool",
                   "nova_object.namespace": "nova",
                   "nova_object.version": "1.1"
               },
               {
                   "nova_object.changes": [
                       "count",
                       "numa_node",
                       "vendor_id",
                       "product_id",
                       "tags"
                   ],
                   "nova_object.data": {
                       "count": 1,
                       "numa_node": null,
                       "product_id": "8139",
                       "tags": {
                           "dev_type": "type-PCI",
                           "networkgroup": "nw2",
                           "switch": "sw2"
                       },
                       "vendor_id": "10ec"
                   },
                   "nova_object.name": "PciDevicePool",
                   "nova_object.namespace": "nova",
                   "nova_object.version": "1.1"
               }
           ]
       },
       "nova_object.name": "PciDevicePoolList",
       "nova_object.namespace": "nova",
       "nova_object.version": "1.1"
   }
   |
   +---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
   1 row in set (0,00 sec)
   #+END_SRC

4. Create flavor.
   openstack flavor create pci_network --ram 300 --disk 5 --vcpus 2
   openstack flavor set pci_network --property "pci_passthrough:alias"="network:2"

5. Boot server.
   openstack server create --flavor pci_network --image cirros-0.3.5-x86_64-disk $(rname.sh)

